#### ValueAtPointBase Members

---

|  |
| --- |
| ValueAtPointBase Class   Methods   Properties   See Also |

The  ValueAtPointBase  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | ClearAllFlags | Sets flags for all measurements to ValueAtPointFlags::None. |
| Public method | ClearFlagsAt | Sets flags for the given measurement to ValueAtPointFlags::None. |
| Public method | Dispose | Releases all resources used by the  ValueAtPointBase |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFlags | Returns flags for the given measurement. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetFlags(IList Int32 ) | Independently sets the flags associated to all measurements. |
| Public method | SetFlags(Int32) | Sets the flags associated to all measurements to the same value. |
| Public method | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ValueAtPointBase Class

Autodesk.Revit.DB Namespace